In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
df.dtypes

Survived                     int64
Pclass                       int64
Name                        object
Sex                         object
Age                        float64
Siblings/Spouses Aboard      int64
Parents/Children Aboard      int64
Fare                       float64
dtype: object

We have some very long names!

In [21]:
len(max(df['Name']))

55

And some ages that are very specific...

In [7]:
df[df['Age'] % 1 != 0]['Age']

56     28.50
77      0.83
110    14.50
115    70.50
121    32.50
122    32.50
147    36.50
151    55.50
152    40.50
202    45.50
226    20.50
294    23.50
303     0.92
329    45.50
466     0.75
522    40.50
641     0.75
673    24.50
731    28.50
751     0.67
763    30.50
799     0.42
810    30.50
827     0.83
839    34.50
Name: Age, dtype: float64

Why would they include 4 decimal places?

In [16]:
df['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
882    13.0000
883    30.0000
884    23.4500
885    30.0000
886     7.7500
Name: Fare, Length: 887, dtype: float64

In [92]:
str(df.loc[0,:].tolist()).replace('[','(').replace(']',')')

"(0, 3, 'Mr. Owen Harris Braund', 'male', 22.0, 1, 0, 7.25)"

In [98]:
titanic_list = []
for i in df.index:
    titanic_list.append(df.loc[i,:].tolist())

In [105]:
str(titanic_list[3]).replace('[','(').replace(']',')')

"(1, 1, 'Mrs. Jacques Heath (Lily May Peel) Futrelle', 'female', 35.0, 1, 0, 53.1)"

In [102]:
for i in titanic_list:
    print(str(i).replace('[','(').replace(']',')'))

(Alice Munger) Silvey', 'female', 39.0, 1, 0, 55.9)
(0, 3, 'Mrs. Joseph (Maria Elias) Caram', 'female', 18.0, 1, 0, 14.4583)
(1, 3, 'Mr. Eiriik Jussila', 'male', 32.0, 0, 0, 7.925)
(1, 2, 'Miss. Julie Rachel Christy', 'female', 25.0, 1, 1, 30.0)
(1, 1, 'Mrs. John Borland (Marian Longstreth Morris) Thayer', 'female', 39.0, 1, 1, 110.8833)
(0, 2, 'Mr. William James Downton', 'male', 54.0, 0, 0, 26.0)
(0, 1, 'Mr. John Hugo Ross', 'male', 36.0, 0, 0, 40.125)
(0, 3, 'Mr. Uscher Paulner', 'male', 16.0, 0, 0, 8.7125)
(1, 1, 'Miss. Ruth Taussig', 'female', 18.0, 0, 2, 79.65)
(0, 2, 'Mr. John Denzil Jarvis', 'male', 47.0, 0, 0, 15.0)
(1, 1, 'Mr. Maxmillian Frolicher-Stehli', 'male', 60.0, 1, 1, 79.2)
(0, 3, 'Mr. Eliezer Gilinski', 'male', 22.0, 0, 0, 8.05)
(0, 3, 'Mr. Joseph Murdlin', 'male', 22.0, 0, 0, 8.05)
(0, 3, 'Mr. Matti Rintamaki', 'male', 35.0, 0, 0, 7.125)
(1, 1, 'Mrs. Walter Bertram (Martha Eustis) Stephenson', 'female', 52.0, 1, 0, 78.2667)
(0, 3, 'Mr. William James Elsbury', 'male', 47.0, 0, 0, 7.25)
(0, 3, 'Miss. Mary Bourke', 'female', 40.0, 0, 2, 7.75)
(0, 2, 'Mr. John Henry Chapman', 'male', 37.0, 1, 0, 26.0)
(0, 3, 'Mr. Jean Baptiste Van Impe', 'male', 36.0, 1, 1, 24.15)
(1, 2, 'Miss. Jessie Wills Leitch', 'female', 31.0, 0, 0, 33.0)
(0, 3, 'Mr. Alfred Johnson', 'male', 49.0, 0, 0, 0.0)
(0, 3, 'Mr. Hanna Boulos', 'male', 18.0, 0, 0, 7.225)
(1, 1, 'Sir. Cosmo Edmund Duff Gordon', 'male', 49.0, 1, 0, 56.9292)
(1, 2, 'Mrs. Sidney Samuel (Amy Frances Christy) Jacobsohn', 'female', 24.0, 2, 1, 27.0)
(0, 3, 'Mr. Petco Slabenoff', 'male', 42.0, 0, 0, 7.8958)
(0, 1, 'Mr. Charles H Harrington', 'male', 37.0, 0, 0, 42.4)
(0, 3, 'Mr. Ernst William Torber', 'male', 44.0, 0, 0, 8.05)
(1, 1, 'Mr. Harry Homer', 'male', 35.0, 0, 0, 26.55)
(0, 3, 'Mr. Edvard Bengtsson Lindell', 'male', 36.0, 1, 0, 15.55)
(0, 3, 'Mr. Milan Karaic', 'male', 30.0, 0, 0, 7.8958)
(1, 1, 'Mr. Robert Williams Daniel', 'male', 27.0, 0, 0, 30.5)
(1, 2, 'Mrs. Joseph (Juliette Marie Louise Lafargue) Laroche', 'female', 22.0, 1, 2, 41.5792)
(1, 1, 'Miss. Elizabeth W Shutes', 'female', 40.0, 0, 0, 153.4625)
(0, 3, 'Mrs. Anders Johan (Alfrida Konstantia Brogren) Andersson', 'female', 39.0, 1, 5, 31.275)
(0, 3, 'Mr. Jose Neto Jardin', 'male', 21.0, 0, 0, 7.05)
(1, 3, 'Miss. Margaret Jane Murphy', 'female', 18.0, 1, 0, 15.5)
(0, 3, 'Mr. John Horgan', 'male', 22.0, 0, 0, 7.75)
(0, 3, 'Mr. William Alfred Brocklebank', 'male', 35.0, 0, 0, 8.05)
(1, 2, 'Miss. Alice Herman', 'female', 24.0, 1, 2, 65.0)
(0, 3, 'Mr. Ernst Gilbert Danbom', 'male', 34.0, 1, 1, 14.4)
(0, 3, 'Mrs. William Arthur (Cordelia K Stanlick) Lobb', 'female', 26.0, 1, 0, 16.1)
(1, 2, 'Miss. Marion Louise Becker', 'female', 4.0, 2, 1, 39.0)
(0, 2, 'Mr. Lawrence Gavey', 'male', 26.0, 0, 0, 10.5)
(0, 3, 'Mr. Antoni Yasbeck', 'male', 27.0, 1, 0, 14.4542)
(1, 1, 'Mr. Edwin Nelson Jr Kimball', 'male', 42.0, 1, 0, 52.5542)
(1, 3, 'Mr. Sahid Nakid', 'male', 20.0, 1, 1, 15.7417)
(0, 3, 'Mr. Henry Damsgaard Hansen', 'male', 21.0, 0, 0, 7.8542)
(0, 3, 'Mr. David John Bowen', 'male', 21.0, 0, 0, 16.1)
(0, 1, 'Mr. Frederick Sutton', 'male', 61.0, 0, 0, 32.3208)
(0, 2, 'Rev. Charles Leonard Kirkland', 'male', 57.0, 0, 0, 12.35)
(1, 1, 'Miss. Gretchen Fiske Longley', 'female', 21.0, 0, 0, 77.9583)
(0, 3, 'Mr. Guentcho Bostandyeff', 'male', 26.0, 0, 0, 7.8958)
(0, 3, "Mr. Patrick D O'Connell", 'male', 18.0, 0, 0, 7.7333)
(1, 1, 'Mr. Algernon Henry Wilson Barkworth', 'male', 80.0, 0, 0, 30.0)
(0, 3, 'Mr. Johan Svensson Lundahl', 'male', 51.0, 0, 0, 7.0542)
(1, 1, 'Dr. Max Stahelin-Maeglin', 'male', 32.0, 0, 0, 30.5)
(0, 1, 'Mr. William Henry Marsh Parr', 'male', 30.0, 0, 0, 0.0)
(0, 3, 'Miss. Mabel Skoog', 'female', 9.0, 3, 2, 27.9)
(1, 2, 'Miss. Mary Davis', 'female', 28.0, 0, 0, 13.0)
(0, 3, 'Mr. Antti Gustaf Leinonen', 'male', 32.0, 0, 0, 7.925)
(0, 2, 'Mr. Harvey Collyer', 'male', 31.0, 1, 1, 26.25)
(0, 3, 'Mrs. Juha (Maria Emilia Ojala) Panula', 'female', 41.0, 0, 5, 39.6875)
(0, 3, 'Mr. Percival Thorneycroft', 'male', 37.0, 1, 0, 16.1)
(0, 3, 'Mr. Hans Peder Jensen', 'male', 20.0, 0, 0, 7.8542)
(1, 1, 'Mlle. Emma Sagesser', 'female', 24.0, 0, 0, 69.3)
(0, 3, 'Miss. Margit Elizabeth Skoog', 'female', 2.0, 3, 2, 27.9)
(1, 3, 'Mr. Choong Foo', 'male', 32.0, 0, 0, 56.4958)
(1, 3, 'Miss. Eugenie Baclini', 'female', 0.75, 2, 1, 19.2583)
(1, 1, 'Mr. Henry Sleeper Harper', 'male', 48.0, 1, 0, 76.7292)
(0, 3, 'Mr. Liudevit Cor', 'male', 19.0, 0, 0, 7.8958)
(1, 1, 'Col. Oberst Alfons Simonius-Blumer', 'male', 56.0, 0, 0, 35.5)
(0, 3, 'Mr. Edward Willey', 'male', 21.0, 0, 0, 7.55)
(1, 3, 'Miss. Amy Zillah Elsie Stanley', 'female', 23.0, 0, 0, 7.55)
(0, 3, 'Mr. Mito Mitkoff', 'male', 23.0, 0, 0, 7.8958)
(1, 2, 'Miss. Elsie Doling', 'female', 18.0, 0, 1, 23.0)
(0, 3, 'Mr. Johannes Halvorsen Kalvik', 'male', 21.0, 0, 0, 8.4333)
(1, 3, "Miss. Hanora O'Leary", 'female', 16.0, 0, 0, 7.8292)
(0, 3, 'Miss. Hanora Hegarty', 'female', 18.0, 0, 0, 6.75)
(0, 2, 'Mr. Leonard Mark Hickman', 'male', 24.0, 2, 0, 73.5)
(0, 3, 'Mr. Alexander Radeff', 'male', 27.0, 0, 0, 7.8958)
(0, 3, 'Mrs. John (Catherine) Bourke', 'female', 32.0, 1, 1, 15.5)
(0, 2, 'Mr. George Floyd Eitemiller', 'male', 23.0, 0, 0, 13.0)
(0, 1, 'Mr. Arthur Webster Newell', 'male', 58.0, 0, 2, 113.275)
(1, 1, 'Dr. Henry William Frauenthal', 'male', 50.0, 2, 0, 133.65)
(0, 3, 'Mr. Mohamed Badt', 'male', 40.0, 0, 0, 7.225)
(0, 1, 'Mr. Edward Pomeroy Colley', 'male', 47.0, 0, 0, 25.5875)
(0, 3, 'Mr. Peju Coleff', 'male', 36.0, 0, 0, 7.4958)
(1, 3, 'Mr. Eino William Lindqvist', 'male', 20.0, 1, 0, 7.925)
(0, 2, 'Mr. Lewis Hickman', 'male', 32.0, 2, 0, 73.5)
(0, 2, 'Mr. Reginald Fenton Butler', 'male', 25.0, 0, 0, 13.0)
(0, 3, 'Mr. Knud Paust Rommetvedt', 'male', 49.0, 0, 0, 7.775)
(0, 3, 'Mr. Jacob Cook', 'male', 43.0, 0, 0, 8.05)
(1, 1, 'Mrs. Elmer Zebley (Juliet Cummins Wright) Taylor', 'female', 48.0, 1, 0, 52.0)
(1, 2, 'Mrs. Thomas William Solomon (Elizabeth Catherine Ford) Brown', 'female', 40.0, 1, 1, 39.0)
(0, 1, 'Mr. Thornton Davidson', 'male', 31.0, 1, 0, 52.0)
(0, 2, 'Mr. Henry Michael Mitchell', 'male', 70.0, 0, 0, 10.5)
(1, 2, 'Mr. Charles Wilhelms', 'male', 31.0, 0, 0, 13.0)
(0, 2, 'Mr. Ennis Hastings Watson', 'male', 19.0, 0, 0, 0.0)
(0, 3, 'Mr. Gustaf Hjalmar Edvardsson', 'male', 18.0, 0, 0, 7.775)
(0, 3, 'Mr. Frederick Charles Sawyer', 'male', 24.5, 0, 0, 8.05)
(1, 3, 'Miss. Anna Sofia Turja', 'female', 18.0, 0, 0, 9.8417)
(0, 3, 'Mrs. Frederick (Augusta Tyler) Goodwin', 'female', 43.0, 1, 6, 46.9)
(1, 1, 'Mr. Thomas Drake Martinez Cardeza', 'male', 36.0, 0, 1, 512.3292)
(0, 3, 'Miss. Katie Peters', 'female', 28.0, 0, 0, 8.1375)
(1, 1, 'Mr. Hammad Hassab', 'male', 27.0, 0, 0, 76.7292)
(0, 3, 'Mr. Thor Anderson Olsvigen', 'male', 20.0, 0, 0, 9.225)
(0, 3, 'Mr. Charles Edward Goodwin', 'male', 14.0, 5, 2, 46.9)
(0, 2, 'Mr. Thomas William Solomon Brown', 'male', 60.0, 1, 1, 39.0)
(0, 2, 'Mr. Joseph Philippe Lemercier Laroche', 'male', 25.0, 1, 2, 41.5792)
(0, 3, 'Mr. Jaako Arnold Panula', 'male', 14.0, 4, 1, 39.6875)
(0, 3, 'Mr. Branko Dakic', 'male', 19.0, 0, 0, 10.1708)
(0, 3, 'Mr. Eberhard Thelander Fischer', 'male', 18.0, 0, 0, 7.7958)
(1, 1, 'Miss. Georgette Alexandra Madill', 'female', 15.0, 0, 1, 211.3375)
(1, 1, 'Mr. Albert Adrian Dick', 'male', 31.0, 1, 0, 57.0)
(1, 3, 'Miss. Manca Karun', 'female', 4.0, 0, 1, 13.4167)
(1, 3, 'Mr. Ali Lam', 'male', 37.0, 0, 0, 56.4958)
(0, 3, 'Mr. Khalil Saad', 'male', 25.0, 0, 0, 7.225)
(0, 1, 'Col. John Weir', 'male', 60.0, 0, 0, 26.55)
(0, 2, 'Mr. Charles Henry Chapman', 'male', 52.0, 0, 0, 13.5)
(0, 3, 'Mr. James Kelly', 'male', 44.0, 0, 0, 8.05)
(1, 3, 'Miss. Katherine Mullens', 'female', 19.0, 0, 0, 7.7333)
(0, 1, 'Mr. John Borland Thayer', 'male', 49.0, 1, 1, 110.8833)
(0, 3, 'Mr. Adolf Mathias Nicolai Olsen Humblen', 'male', 42.0, 0, 0, 7.65)
(1, 1, 'Mrs. John Jacob (Madeleine Talmadge Force) Astor', 'female', 18.0, 1, 0, 227.525)
(1, 1, 'Mr. Spencer Victor Silverthorne', 'male', 35.0, 0, 0, 26.2875)
(0, 3, 'Miss. Saiide Barbara', 'female', 18.0, 0, 1, 14.4542)
(0, 3, 'Mr. Martin Gallagher', 'male', 25.0, 0, 0, 7.7417)
(0, 3, 'Mr. Henrik Juul Hansen', 'male', 26.0, 1, 0, 7.8542)
(0, 2, 'Mr. Henry Samuel Morley', 'male', 39.0, 0, 0, 26.0)
(1, 2, 'Mrs. Florence Kelly', 'female', 45.0, 0, 0, 13.5)
(1, 1, 'Mr. Edward Pennington Calderhead', 'male', 42.0, 0, 0, 26.2875)
(1, 1, 'Miss. Alice Cleaver', 'female', 22.0, 0, 0, 151.55)
(1, 3, 'Master. Halim Gonios Moubarek', 'male', 4.0, 1, 1, 15.2458)
(1, 1, 'Mlle. Berthe Antonine Mayne', 'female', 24.0, 0, 0, 49.5042)
(0, 1, 'Mr. Herman Klaber', 'male', 41.0, 0, 0, 26.55)
(1, 1, 'Mr. Elmer Zebley Taylor', 'male', 48.0, 1, 0, 52.0)
(0, 3, 'Mr. August Viktor Larsson', 'male', 29.0, 0, 0, 9.4833)
(0, 2, 'Mr. Samuel Greenberg', 'male', 52.0, 0, 0, 13.0)
(0, 3, 'Mr. Peter Andreas Lauritz Andersen Soholt', 'male', 19.0, 0, 0, 7.65)
(1, 1, 'Miss. Caroline Louise Endres', 'female', 38.0, 0, 0, 227.525)
(1, 2, 'Miss. Edwina Celia Troutt', 'female', 27.0, 0, 0, 10.5)
(0, 3, 'Mr. Malkolm Joackim Johnson', 'male', 33.0, 0, 0, 7.775)
(1, 2, 'Miss. Annie Jessie Harper', 'female', 6.0, 0, 1, 33.0)
(0, 3, 'Mr. Svend Lauritz Jensen', 'male', 17.0, 1, 0, 7.0542)
(0, 2, 'Mr. William Henry Gillespie', 'male', 34.0, 0, 0, 13.0)
(0, 2, 'Mr. Henry Price Hodges', 'male', 50.0, 0, 0, 13.0)
(1, 1, 'Mr. Norman Campbell Chambers', 'male', 27.0, 1, 0, 53.1)
(0, 3, 'Mr. Luka Oreskovic', 'male', 20.0, 0, 0, 8.6625)
(1, 2, 'Mrs. Peter Henry (Lillian Jefferys) Renouf', 'female', 30.0, 3, 0, 21.0)
(1, 3, 'Miss. Margareth Mannion', 'female', 28.0, 0, 0, 7.7375)
(0, 2, 'Mr. Kurt Arnold Gottfrid Bryhl', 'male', 25.0, 1, 0, 26.0)
(0, 3, 'Miss. Pieta Sofia Ilmakangas', 'female', 25.0, 1, 0, 7.925)
(1, 1, 'Miss. Elisabeth Walton Allen', 'female', 29.0, 0, 0, 211.3375)
(0, 3, 'Mr. Houssein G N Hassan', 'male', 11.0, 0, 0, 18.7875)
(0, 2, 'Mr. Robert J Knight', 'male', 41.0, 0, 0, 0.0)
(0, 2, 'Mr. William John Berriman', 'male', 23.0, 0, 0, 13.0)
(0, 2, 'Mr. Moses Aaron Troupiansky', 'male', 23.0, 0, 0, 13.0)
(0, 3, 'Mr. Leslie Williams', 'male', 28.5, 0, 0, 16.1)
(0, 3, 'Mrs. Edward (Margaret Ann Watson) Ford', 'female', 48.0, 1, 3, 34.375)
(1, 1, 'Mr. Gustave J Lesurer', 'male', 35.0, 0, 0, 512.3292)
(0, 3, 'Mr. Kanio Ivanoff', 'male', 20.0, 0, 0, 7.8958)
(0, 3, 'Mr. Minko Nankoff', 'male', 32.0, 0, 0, 7.8958)
(1, 1, 'Mr. Walter James Hawksford', 'male', 45.0, 0, 0, 30.0)
(0, 1, 'Mr. Tyrell William Cavendish', 'male', 36.0, 1, 0, 78.85)
(1, 1, 'Miss. Susan Parker Ryerson', 'female', 21.0, 2, 2, 262.375)
(0, 3, 'Mr. Neal McNamee', 'male', 24.0, 1, 0, 16.1)
(1, 3, 'Mr. Juho Stranden', 'male', 31.0, 0, 0, 7.925)
(0, 1, 'Capt. Edward Gifford Crosby', 'male', 70.0, 1, 1, 71.0)
(0, 3, 'Mr. Rossmore Edward Abbott', 'male', 16.0, 1, 1, 20.25)
(1, 2, 'Miss. Anna Sinkkonen', 'female', 30.0, 0, 0, 13.0)
(0, 1, 'Mr. Daniel Warner Marvin', 'male', 19.0, 1, 0, 53.1)
(0, 3, 'Mr. Michael Connaghton', 'male', 31.0, 0, 0, 7.75)
(1, 2, 'Miss. Joan Wells', 'female', 4.0, 1, 1, 23.0)
(1, 3, 'Master. Meier Moor', 'male', 6.0, 0, 1, 12.475)
(0, 3, 'Mr. Johannes Joseph Vande Velde', 'male', 33.0, 0, 0, 9.5)
(0, 3, 'Mr. Lalio Jonkoff', 'male', 23.0, 0, 0, 7.8958)
(1, 2, 'Mrs. Samuel (Jane Laver) Herman', 'female', 48.0, 1, 2, 65.0)
(1, 2, 'Master. Viljo Hamalainen', 'male', 0.67, 1, 1, 14.5)
(0, 3, 'Mr. August Sigfrid Carlsson', 'male', 28.0, 0, 0, 7.7958)
(0, 2, 'Mr. Percy Andrew Bailey', 'male', 18.0, 0, 0, 11.5)
(0, 3, 'Mr. Thomas Leonard Theobald', 'male', 34.0, 0, 0, 8.05)
(1, 1, 'the Countess. of (Lucy Noel Martha Dyer-Edwards) Rothes', 'female', 33.0, 0, 0, 86.5)
(0, 3, 'Mr. John Garfirth', 'male', 23.0, 0, 0, 14.5)
(0, 3, 'Mr. Iisakki Antino Aijo Nirva', 'male', 41.0, 0, 0, 7.125)
(1, 3, 'Mr. Hanna Assi Barah', 'male', 20.0, 0, 0, 7.2292)
(1, 1, 'Mrs. William Ernest (Lucile Polk) Carter', 'female', 36.0, 1, 2, 120.0)
(0, 3, 'Mr. Hans Linus Eklund', 'male', 16.0, 0, 0, 7.775)
(1, 1, 'Mrs. John C (Anna Andrews) Hogeboom', 'female', 51.0, 1, 0, 77.9583)
(0, 1, 'Dr. Arthur Jackson Brewe', 'male', 46.0, 0, 0, 39.6)
(0, 3, 'Miss. Mary Mangan', 'female', 30.5, 0, 0, 7.75)
(0, 3, 'Mr. Daniel J Moran', 'male', 28.0, 1, 0, 24.15)
(0, 3, 'Mr. Daniel Danielsen Gronnestad', 'male', 32.0, 0, 0, 8.3625)
(0, 3, 'Mr. Rene Aime Lievens', 'male', 24.0, 0, 0, 9.5)
(0, 3, 'Mr. Niels Peder Jensen', 'male', 48.0, 0, 0, 7.8542)
(0, 2, 'Mrs. (Mary) Mack', 'female', 57.0, 0, 0, 10.5)
(0, 3, 'Mr. Dibo Elias', 'male', 29.0, 0, 0, 7.225)
(1, 2, 'Mrs. Elizabeth (Eliza Needs) Hocking', 'female', 54.0, 1, 3, 23.0)
(0, 3, 'Mr. Pehr Fabian Oliver Malkolm Myhrman', 'male', 18.0, 0, 0, 7.75)
(0, 3, 'Mr. Roger Tobin', 'male', 20.0, 0, 0, 7.75)
(1, 3, 'Miss. Virginia Ethel Emanuel', 'female', 5.0, 0, 0, 12.475)
(0, 3, 'Mr. Thomas J Kilgannon', 'male', 22.0, 0, 0, 7.7375)
(1, 1, 'Mrs. Edward Scott (Elisabeth Walton McMillan) Robert', 'female', 43.0, 0, 1, 211.3375)
(1, 3, 'Miss. Banoura Ayoub', 'female', 13.0, 0, 0, 7.2292)
(1, 1, 'Mrs. Albert Adrian (Vera Gillespie) Dick', 'female', 17.0, 1, 0, 57.0)
(0, 1, 'Mr. Milton Clyde Long', 'male', 29.0, 0, 0, 30.0)
(0, 3, 'Mr. Andrew G Johnston', 'male', 35.0, 1, 2, 23.45)
(0, 3, 'Mr. William Ali', 'male', 25.0, 0, 0, 7.05)
(0, 3, 'Mr. Abraham (David Lishin) Harmer', 'male', 25.0, 0, 0, 7.25)
(1, 3, 'Miss. Anna Sofia Sjoblom', 'female', 18.0, 0, 0, 7.4958)
(0, 3, 'Master. George Hugh Rice', 'male', 8.0, 4, 1, 29.125)
(1, 3, 'Master. Bertram Vere Dean', 'male', 1.0, 1, 2, 20.575)
(0, 1, 'Mr. Benjamin Guggenheim', 'male', 46.0, 0, 0, 79.2)
(0, 3, 'Mr. Andrew Keane', 'male', 20.0, 0, 0, 7.75)
(0, 2, 'Mr. Alfred Gaskell', 'male', 16.0, 0, 0, 26.0)
(0, 3, 'Miss. Stella Anna Sage', 'female', 21.0, 8, 2, 69.55)
(0, 1, 'Mr. William Fisher Hoyt', 'male', 43.0, 0, 0, 30.6958)
(0, 3, 'Mr. Ristiu Dantcheff', 'male', 25.0, 0, 0, 7.8958)
(0, 2, 'Mr. Richard Otter', 'male', 39.0, 0, 0, 13.0)
(1, 1, 'Dr. Alice (Farnham) Leader', 'female', 49.0, 0, 0, 25.9292)
(1, 3, 'Mrs. Mara Osman', 'female', 31.0, 0, 0, 8.6833)
(0, 3, 'Mr. Yousseff Ibrahim Shawah', 'male', 30.0, 0, 0, 7.2292)
(0, 3, 'Mrs. Jean Baptiste (Rosalie Paula Govaert) Van Impe', 'female', 30.0, 1, 1, 24.15)
(0, 2, 'Mr. Martin Ponesell', 'male', 34.0, 0, 0, 13.0)
(1, 2, 'Mrs. Harvey (Charlotte Annie Tate) Collyer', 'female', 31.0, 1, 1, 26.25)
(1, 1, 'Master. William Thornton II Carter', 'male', 11.0, 1, 2, 120.0)
(1, 3, 'Master. Assad Alexander Thomas', 'male', 0.42, 0, 1, 8.5167)
(1, 3, 'Mr. Oskar Arvid Hedman', 'male', 27.0, 0, 0, 6.975)
(0, 3, 'Mr. Karl Johan Johansson', 'male', 31.0, 0, 0, 7.775)
(0, 1, 'Mr. Thomas Jr Andrews', 'male', 39.0, 0, 0, 0.0)
(0, 3, 'Miss. Ellen Natalia Pettersson', 'female', 18.0, 0, 0, 7.775)
(0, 2, 'Mr. August Meyer', 'male', 39.0, 0, 0, 13.0)
(1, 1, 'Mrs. Norman Campbell (Bertha Griggs) Chambers', 'female', 33.0, 1, 0, 53.1)
(0, 3, 'Mr. William Alexander', 'male', 26.0, 0, 0, 7.8875)
(0, 3, 'Mr. James Lester', 'male', 39.0, 0, 0, 24.15)
(0, 2, 'Mr. Richard James Slemen', 'male', 35.0, 0, 0, 10.5)
(0, 3, 'Miss. Ebba Iris Alfrida Andersson', 'female', 6.0, 4, 2, 31.275)
(0, 3, 'Mr. Ernest Portage Tomlin', 'male', 30.5, 0, 0, 8.05)
(0, 1, 'Mr. Richard Fry', 'male', 39.0, 0, 0, 0.0)
(0, 3, 'Miss. Wendla Maria Heininen', 'female', 23.0, 0, 0, 7.925)
(0, 2, 'Mr. Albert Mallet', 'male', 31.0, 1, 1, 37.0042)
(0, 3, 'Mr. John Fredrik Alexander Holm', 'male', 43.0, 0, 0, 6.45)
(0, 3, 'Master. Karl Thorsten Skoog', 'male', 10.0, 3, 2, 27.9)
(1, 1, 'Mrs. Charles Melville (Clara Jennings Gregg) Hays', 'female', 52.0, 1, 1, 93.5)
(1, 3, 'Mr. Nikola Lulic', 'male', 27.0, 0, 0, 8.6625)
(0, 1, 'Jonkheer. John George Reuchlin', 'male', 38.0, 0, 0, 0.0)
(1, 3, 'Mrs. (Beila) Moor', 'female', 27.0, 0, 1, 12.475)
(0, 3, 'Master. Urho Abraham Panula', 'male', 2.0, 4, 1, 39.6875)
(0, 3, 'Mr. John Flynn', 'male', 36.0, 0, 0, 6.95)
(0, 3, 'Mr. Len Lam', 'male', 23.0, 0, 0, 56.4958)
(1, 2, 'Master. Andre Mallet', 'male', 1.0, 0, 2, 37.0042)
(1, 3, 'Mr. Thomas Joseph McCormack', 'male', 19.0, 0, 0, 7.75)
(1, 1, 'Mrs. George Nelson (Martha Evelyn) Stone', 'female', 62.0, 0, 0, 80.0)
(1, 3, 'Mrs. Antoni (Selini Alexander) Yasbeck', 'female', 15.0, 1, 0, 14.4542)
(1, 2, 'Master. George Sibley Richards', 'male', 0.83, 1, 1, 18.75)
(0, 3, 'Mr. Amin Saad', 'male', 30.0, 0, 0, 7.2292)
(0, 3, 'Mr. Albert Augustsson', 'male', 23.0, 0, 0, 7.8542)
(0, 3, 'Mr. Owen George Allum', 'male', 18.0, 0, 0, 8.3)
(1, 1, 'Miss. Sara Rebecca Compton', 'female', 39.0, 1, 1, 83.1583)
(0, 3, 'Mr. Jakob Pasic', 'male', 21.0, 0, 0, 8.6625)
(0, 3, 'Mr. Maurice Sirota', 'male', 20.0, 0, 0, 8.05)
(1, 3, 'Mr. Chang Chip', 'male', 32.0, 0, 0, 56.4958)
(1, 1, 'Mr. Pierre Marechal', 'male', 29.0, 0, 0, 29.7)
(0, 3, 'Mr. Ilmari Rudolf Alhomaki', 'male', 20.0, 0, 0, 7.925)
(0, 2, 'Mr. Thomas Charles Mudd', 'male', 16.0, 0, 0, 10.5)
(1, 1, 'Miss. Augusta Serepeca', 'female', 30.0, 0, 0, 31.0)
(0, 3, 'Mr. Peter L Lemberopolous', 'male', 34.5, 0, 0, 6.4375)
(0, 3, 'Mr. Jeso Culumovic', 'male', 17.0, 0, 0, 8.6625)
(0, 3, 'Mr. Anthony Abbing', 'male', 42.0, 0, 0, 7.55)
(0, 3, 'Mr. Douglas Bullen Sage', 'male', 18.0, 8, 2, 69.55)
(0, 3, 'Mr. Marin Markoff', 'male', 35.0, 0, 0, 7.8958)
(0, 2, 'Rev. John Harper', 'male', 28.0, 0, 1, 33.0)
(1, 1, 'Mrs. Samuel L (Edwiga Grabowska) Goldenberg', 'female', 40.0, 1, 0, 89.1042)
(0, 3, 'Master. Sigvard Harald Elias Andersson', 'male', 4.0, 4, 2, 31.275)
(0, 3, 'Mr. Johan Svensson', 'male', 74.0, 0, 0, 7.775)
(0, 3, 'Miss. Nourelain Boulos', 'female', 9.0, 1, 1, 15.2458)
(1, 1, 'Miss. Mary Conover Lines', 'female', 16.0, 0, 1, 39.4)
(0, 2, 'Mrs. Ernest Courtenay (Lilian Hughes) Carter', 'female', 44.0, 1, 0, 26.0)
(1, 3, 'Mrs. Sam (Leah Rosen) Aks', 'female', 18.0, 0, 1, 9.35)
(1, 1, 'Mrs. George Dennick (Mary Hitchcock) Wick', 'female', 45.0, 1, 1, 164.8667)
(1, 1, 'Mr. Peter Denis Daly', 'male', 51.0, 0, 0, 26.55)
(1, 3, 'Mrs. Solomon (Latifa Qurban) Baclini', 'female', 24.0, 0, 3, 19.2583)
(0, 3, 'Mr. Raihed Razi', 'male', 30.0, 0, 0, 7.2292)
(0, 3, 'Mr. Claus Peter Hansen', 'male', 41.0, 2, 0, 14.1083)
(0, 2, 'Mr. Frederick Edward Giles', 'male', 21.0, 1, 0, 11.5)
(1, 1, 'Mrs. Frederick Joel (Margaret Welles Barron) Swift', 'female', 48.0, 0, 0, 25.9292)
(0, 3, 'Miss. Dorothy Edith Sage', 'female', 14.0, 8, 2, 69.55)
(0, 2, 'Mr. John William Gill', 'male', 24.0, 0, 0, 13.0)
(1, 2, 'Mrs. (Karolina) Bystrom', 'female', 42.0, 0, 0, 13.0)
(1, 2, 'Miss. Asuncion Duran y More', 'female', 27.0, 1, 0, 13.8583)
(0, 1, 'Mr. Washington Augustus II Roebling', 'male', 31.0, 0, 0, 50.4958)
(0, 3, 'Mr. Philemon van Melkebeke', 'male', 23.0, 0, 0, 9.5)
(1, 3, 'Master. Harold Theodor Johnson', 'male', 4.0, 1, 1, 11.1333)
(0, 3, 'Mr. Cerin Balkic', 'male', 26.0, 0, 0, 7.8958)
(1, 1, 'Mrs. Richard Leonard (Sallie Monypeny) Beckwith', 'female', 47.0, 1, 1, 52.5542)
(0, 1, 'Mr. Frans Olof Carlsson', 'male', 33.0, 0, 0, 5.0)
(0, 3, 'Mr. Victor Vander Cruyssen', 'male', 47.0, 0, 0, 9.0)
(1, 2, 'Mrs. Samuel (Hannah Wizosky) Abelson', 'female', 28.0, 1, 0, 24.0)
(1, 3, 'Miss. Adele Kiamie Najib', 'female', 15.0, 0, 0, 7.225)
(0, 3, 'Mr. Alfred Ossian Gustafsson', 'male', 20.0, 0, 0, 9.8458)
(0, 3, 'Mr. Nedelio Petroff', 'male', 19.0, 0, 0, 7.8958)
(0, 3, 'Mr. Kristo Laleff', 'male', 23.0, 0, 0, 7.8958)
(1, 1, 'Mrs. Thomas Jr (Lily Alexenia Wilson) Potter', 'female', 56.0, 0, 1, 83.1583)
(1, 2, 'Mrs. William (Imanita Parrish Hall) Shelley', 'female', 25.0, 0, 1, 26.0)
(0, 3, 'Mr. Johann Markun', 'male', 33.0, 0, 0, 7.8958)
(0, 3, 'Miss. Gerda Ulrika Dahlberg', 'female', 22.0, 0, 0, 10.5167)
(0, 2, 'Mr. Frederick James Banfield', 'male', 28.0, 0, 0, 10.5)
(0, 3, 'Mr. Henry Jr Sutehall', 'male', 25.0, 0, 0, 7.05)
(0, 3, 'Mrs. William (Margaret Norton) Rice', 'female', 39.0, 0, 5, 29.125)
(0, 2, 'Rev. Juozas Montvila', 'male', 27.0, 0, 0, 13.0)
(1, 1, 'Miss. Margaret Edith Graham', 'female', 19.0, 0, 0, 30.0)
(0, 3, 'Miss. Catherine Helen Johnston', 'female', 7.0, 1, 2, 23.45)
(1, 1, 'Mr. Karl Howell Behr', 'male', 26.0, 0, 0, 30.0)
(0, 3, 'Mr. Patrick Dooley', 'male', 32.0, 0, 0, 7.75)

In [112]:
df[df['Name'].str.contains("\'" or "\'")]

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
8,1,3,Mrs. Oscar W (Elisabeth Vilhelmina Berg) Johnson,female,27.0,0,2,11.1333
9,1,2,Mrs. Nicholas (Adele Achem) Nasser,female,14.0,1,0,30.0708
15,1,2,Mrs. (Mary D Kingcome) Hewlett,female,55.0,0,0,16.0000
...,...,...,...,...,...,...,...,...
867,1,1,Mrs. Richard Leonard (Sallie Monypeny) Beckwith,female,47.0,1,1,52.5542
870,1,2,Mrs. Samuel (Hannah Wizosky) Abelson,female,28.0,1,0,24.0000
875,1,1,Mrs. Thomas Jr (Lily Alexenia Wilson) Potter,female,56.0,0,1,83.1583
876,1,2,Mrs. William (Imanita Parrish Hall) Shelley,female,25.0,0,1,26.0000
881,0,3,Mrs. William (Margaret Norton) Rice,female,39.0,0,5,29.1250

In [160]:
df1 = df.copy()

In [161]:
df1['Name'] = df1['Name'].str.replace('(', '_').str.replace(')', '_')

In [162]:
df1['Name']

0                                 Mr. Owen Harris Braund
1      Mrs. John Bradley _Florence Briggs Thayer_ Cum...
2                                  Miss. Laina Heikkinen
3            Mrs. Jacques Heath _Lily May Peel_ Futrelle
4                                Mr. William Henry Allen
                             ...
882                                 Rev. Juozas Montvila
883                          Miss. Margaret Edith Graham
884                       Miss. Catherine Helen Johnston
885                                 Mr. Karl Howell Behr
886                                   Mr. Patrick Dooley
Name: Name, Length: 887, dtype: object

In [155]:
df[df['Name'].str.contains("'")]

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
28,1,3,Miss. Ellen O'Dwyer,female,24.0,0,0,7.8792
46,1,3,Miss. Bridget O'Driscoll,female,27.0,0,0,7.7500
185,1,3,Mrs. Thomas (Johanna Godfrey) O'Brien,female,26.0,1,0,15.5000
362,0,3,Mr. Thomas O'Brien,male,27.0,1,0,15.5000
456,0,3,Mr. Maurice O'Connor,male,17.0,0,0,7.7500
499,0,3,Miss. Bridget Mary O'Sullivan,female,21.0,0,0,7.6292
549,0,3,Mr. Timothy O'Brien,male,21.0,0,0,7.8292
626,0,3,Mr. Patrick D O'Connell,male,18.0,0,0,7.7333
650,1,3,Miss. Hanora O'Leary,female,16.0,0,0,7.8292

In [158]:
df1['Name'] = df1['Name'].str.replace("'", ' ')

In [159]:
df1['Name'][28]

'Miss. Ellen O Dwyer'